УТ_для_edt/src/Catalogs/CRM_Триггеры/CRM_Триггеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Триггеры</name>
  <attributes>
    <name>Действие</name>
    <type>
      <types>CatalogRef.CRM_ДействияТриггеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеСрабатывания</name>
    <type>
      <types>CatalogRef.CRM_УсловияСрабатыванияТриггеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиУсловий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиДействий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПовторноеСрабатывание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВЛоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
      <types>CatalogRef.CRM_ТочкиМаршрутов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНастроекУсловия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНастроекДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтложенноеВыполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтложеноНа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтложеноПериодичность</name>
    <type>
      <types>EnumRef.CRM_ПериодичностьОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторятьПриОшибке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторятьЧерез</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьВСостоянииИнтереса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийКарта</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
      <types>CatalogRef.CRM_КартыМаршрутов</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ДействияТриггеров/CRM_ДействияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ДействияТриггеров</name>
  <predefined>
    <items>
      <name>СоздатьВзаимодействие</name>
      <description>Запланировать взаимодействие</description>
    </items>
    <items>
      <name>ПересчетПотенциалаВИнтересе</name>
      <description>Заполнить  поле &quot;Ожидаемая  выручка&quot; </description>
    </items>
    <items>
      <name>ОтказЗаписи</name>
      <description>Запретить запись</description>
    </items>
    <items>
      <name>ЗапретитьРедактированиеДокументаКоммерческоеПредложение</name>
      <description>Запретить редактирование документа Коммерческое предложение</description>
    </items>
    <items>
      <name>СтартПроизвольногоБП</name>
      <description>Запустить бизнес-процесс</description>
    </items>
    <items>
      <name>ИзменениеСостоянияИнтереса</name>
      <description>Изменить состояние интереса</description>
    </items>
    <items>
      <name>ИзменитьТемуИнтереса</name>
      <description>Изменить тему интереса</description>
    </items>
    <items>
      <name>ОповещениеПочта</name>
      <description>Отправить E-mail</description>
    </items>
    <items>
      <name>ОповещениеСМС</name>
      <description>Отправить SMS</description>
    </items>
    <items>
      <name>CRM_Модуль_ПривязкаЗаказовКИнтересам</name>
      <description>Привязка заказов к интересам</description>
    </items>
    <items>
      <name>ПроверитьНаличиеДокументов</name>
      <description>Проверить наличие документов</description>
    </items>
    <items>
      <name>РассылкаПоСегменту</name>
      <description>Рассылка электронных писем  клиентам в сегменте</description>
    </items>
    <items>
      <name>СозданиеЗаявкиНаОснованииПисьма</name>
      <description>Создание заявки(лида) на основании письма</description>
    </items>
    <items>
      <name>ЗаявкаССайта</name>
      <description>Создание интереса клиента (лида) на основание письма-заявки</description>
    </items>
    <items>
      <name>СоздатьЗадачуПоОбъекту</name>
      <description>Создать задачу</description>
    </items>
    <items>
      <name>ОповещениеНапоминание</name>
      <description>Создать напоминание</description>
    </items>
    <items>
      <name>ГенерацияИнтересаПоИнтересу</name>
      <description>Генерация интереса по интересу</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбработкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТипов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_Модуль_РаботаСФормамиСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьСодержаниеДляПечати(Номенклатура, Характеристика) Экспорт
	НаименованиеНоменклатуры = ?(Пустаястрока(Номенклатура.НаименованиеПолное), Номенклатура.Наименование, Номенклатура.НаименованиеПолное);
	Если ЗначениеЗаполнено(Характеристика) Тогда
		НаименованиеХарактеристики = ?(Пустаястрока(Характеристика.НаименованиеПолное), Характеристика.Наименование, Характеристика.НаименованиеПолное);
	Иначе
		НаименованиеХарактеристики = "";
	КонецЕсли;	
	Содержание = НаименованиеНоменклатуры + ?(Пустаястрока(НаименованиеХарактеристики), "", " ("+НаименованиеХарактеристики+")");
	Возврат Содержание;
КонецФункции

#Область ДобавлениеРеквизитовВФормы

Процедура ДобавитьЭлементыФормыДляКонтакта(Форма) Экспорт
	
	ЦветРамки = Новый Цвет(221, 221, 221);
	
	Элемент = Форма.Элементы.Найти("ДолжностьПоВизитке");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("ДолжностьПоВизитке", Тип("ПолеФормы"),
			Форма.Элементы.Найти("ГруппаСведения"), Форма.Элементы.Найти("CRM_Состояние"));
		Элемент.ПутьКДанным = "Объект.ДолжностьПоВизитке";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ЦветРамки = ЦветРамки;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбменССайтомФормаУзлаПриСозданииНаСервере(Форма) Экспорт
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "CRM_ТекущийТриггерОбъекта") Тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("CRM_ТекущийТриггерОбъекта", Новый ОписаниеТипов("СправочникСсылка.CRM_Триггеры")));
		
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	Если НЕ Форма.Объект.Ссылка.Пустая() Тогда
		Форма.CRM_ТекущийТриггерОбъекта = ОбменССайтомТриггерСозданияИнтереса(Форма.Объект.Ссылка);
	КонецЕсли;
	
	Гиперссылка = Форма.Элементы.Найти("CRM_Команда_Гиперссылка");
	Если Гиперссылка = Неопределено Тогда
		Гиперссылка = Форма.Элементы.Добавить("CRM_Команда_Гиперссылка", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаЗаказыОсновныеНастройки );
	КонецЕсли;
	Гиперссылка.Заголовок = ОбменССайтомПредставлениеТриггера(Форма.CRM_ТекущийТриггерОбъекта);
		
КонецПроцедуры
	
Функция ОбменССайтомТриггерСозданияИнтереса(НастройкаОбменаССайтом) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_Триггеры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_Триггеры КАК CRM_Триггеры
	                      |ГДЕ
	                      |	CRM_Триггеры.Действие = ЗНАЧЕНИЕ(Справочник.CRM_ДействияТриггеров.CRM_Модуль_ПривязкаЗаказовКИнтересам)
	                      |	И CRM_Триггеры.УсловиеСрабатывания = ЗНАЧЕНИЕ(Справочник.CRM_УсловияСрабатыванияТриггеров.CRM_Модуль_ПриЗаписиЗаказаКлиента)
	                      |	И НЕ CRM_Триггеры.ПометкаУдаления
	                      |	И CRM_Триггеры.Действует");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НастройкиДействия = Выборка.Ссылка.НастройкиДействий.Получить();
		Если ТипЗнч(НастройкиДействия) = Тип("Структура") И НастройкиДействия.Свойство("НастройкаОбменаССайтом")
			И НастройкиДействия.НастройкаОбменаССайтом = НастройкаОбменаССайтом Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция ОбменССайтомПредставлениеТриггера(Триггер) Экспорт
	КомпонентыЗаголовка = Новый Массив;
	Если ЗначениеЗаполнено(Триггер) Тогда
		КомпонентыЗаголовка.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'При загрузке заказов, будут создаваться интересы.'")+Символы.ПС));
		КомпонентыЗаголовка.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Текущие настройки:'")+Символы.ПС));
		КомпонентыЗаголовка.Добавить(Новый ФорматированнаяСтрока(Триггер.ПредставлениеНастроекДействия,
			,,, "e1cib/command/Справочник.CRM_Триггеры.Команда.CRM_Модуль_НастройкаТриггераДляОбменаССайтом"));
	Иначе
		КомпонентыЗаголовка.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Для создания интересов, при загрузке заказов, нужно настроить триггер.'")+" "));
		КомпонентыЗаголовка.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Настроить триггер.'"),
			,,, "e1cib/command/Справочник.CRM_Триггеры.Команда.CRM_Модуль_НастройкаТриггераДляОбменаССайтом"));
	КонецЕсли;
	Возврат Новый ФорматированнаяСтрока(КомпонентыЗаголовка);
КонецФункции

#КонецОбласти

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
